# MySQL 연결

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 582 kB/s eta 0:00:01
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [3]:
import pymysql

In [4]:
# MySQL Connection
conn = pymysql.connect(host="172.20.10.6", user="root", passwd="qwer1234", db="education", charset="utf8")

In [5]:
curs = conn.cursor()

In [6]:
sql = "select * from student"
curs.execute(sql)   # Data 갯수만 알려준다.

7

In [7]:
# Data Fetch
rows = curs.fetchall()     # Tuple로 받아온다!
print(rows)

(('1111', None, None, None, None), ('3333', None, None, None, None), ('4444', 'null5555', 'null', 'null', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S100', '박소명', '컴퓨터공학과', '123-4567', None))

In [8]:
# list로 변환

rowList = list(rows)
print(rowList)

[('1111', None, None, None, None), ('3333', None, None, None, None), ('4444', 'null5555', 'null', 'null', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S005', '김상진', '사학과', '567-8901', None), ('S006', '황정숙', '사학과', '678-9012', None), ('S100', '박소명', '컴퓨터공학과', '123-4567', None)]

In [10]:
print(rowList[0][0])

1111

# Select 의 내용을 DataFrame으로 보기

In [11]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /Users/parkjw/Anaconda/anaconda3/lib/python3.8/site-packages (1.4.7)
Requirement already satisfied: greenlet!=0.4.17 in /Users/parkjw/Anaconda/anaconda3/lib/python3.8/site-packages (from sqlalchemy) (1.0.0)

In [13]:
import pandas as pd
from sqlalchemy import create_engine

In [15]:
engine = create_engine("mysql+pymysql://root:qwer1234@172.20.10.6:3306/education?", convert_unicode=True)
conn = engine.connect()

In [16]:
data = pd.read_sql_table('student', conn)
data

  scode     sname   sdept    sphone saddress
0  1111      None    None      None     None
1  3333      None    None      None     None
2  4444  null5555    null      null     None
3  S002       최민국  컴퓨터공학과  234-5678     None
4  S005       김상진     사학과  567-8901     None
5  S006       황정숙     사학과  678-9012     None
6  S100       박소명  컴퓨터공학과  123-4567     None

# DataFrame을 Database로 Insert하기
: RottenTomatoes 만든 것 MySQL 에 넣어보기!
: MovieList.csv

In [19]:
column = ['rank', 'rating', 'title', 'review']
movies = pd.read_csv('./Data/MovieList.csv')
movies.columns = column
movies.head()

   rank rating                           title  review
0     1    98%  Parasite (Gisaengchung) (2019)     459
1     2    94%        Avengers: Endgame (2019)     542
2     3    97%               Knives Out (2019)     464
3     4    93%                       Us (2019)     551
4     5    97%              Toy Story 4 (2019)     451

In [20]:
engine = create_engine("mysql+pymysql://root:qwer1234@172.20.10.6:3306/MovieRank?", convert_unicode=True)
conn = engine.connect()

In [22]:
movies.to_sql(name='MovieRank', con=engine, if_exists='append', index=False)